{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"4046d176-c03c-5fa6-ab7e-2d3cc1b2e805","fields":{"slug":"/blog/series/2bithistory/semantic-web/"},"frontmatter":{"title":"Whatever Happened to the Semantic Web?","date":"27 May, 2018","desc":"In 2001, Tim Berners-Lee, inventor of the World Wide Web, published an article in Scientific American. Since its introduction only a decade before, the web had fast become the world's best means for sharing documents with  other people. Now, the web would evolve to encompass not just documents but every kind of data one could imagine.\n","categories":null},"excerpt":"In 2001, Tim Berners-Lee, inventor of the World Wide Web, published an article\nin Scientific American. Berners-Lee, along with two other…"}},{"node":{"id":"22111bc9-c9fe-5132-8583-4b0d3840cd14","fields":{"slug":"/blog/series/2bithistory/codd-relational-model/"},"frontmatter":{"title":"Important Papers: Codd and the Relational Model","date":"29 December, 2017","desc":"The relational model was introduced in 1970. Edgar Codd, a researcher at IBM, published a paper called \"A Relational Model of Data for Large Shared Data Banks.\" The paper is unassuming; Codd only claims to have employed a  novel tool (the mathematical notion of a \"relation\") to address some of the inadequacies of the prevailing database models.\n","categories":null},"excerpt":"It's hard to believe today, but the relational database was once the cool new\nkid on the block. In 2017, the relational model competes with…"}},{"node":{"id":"b1db7b98-c996-54e0-be3c-f886ff7d31c5","fields":{"slug":"/blog/series/2bithistory/simulating-the-altair/"},"frontmatter":{"title":"Simulating the Altair","date":"02 December, 2017","desc":"The Altair 8800 was a build-it-yourself home computer kit released in 1975. The Altair was basically the first personal computer, though it predated the advent of that term by several years.\n","categories":null},"excerpt":"The  Altair 8800  was a\nbuild-it-yourself home computer kit released in 1975. The Altair was basically\nthe first personal computer, though…"}},{"node":{"id":"89f67bfc-77b2-5da7-99f1-6b8bd2c3796f","fields":{"slug":"/blog/series/2bithistory/the-ruby-story/"},"frontmatter":{"title":"The Ruby Story","date":"19 November, 2017","desc":"We take a look at the history of Ruby. How and why it was started by a recent college grad, Yukihiro Matsumoto in 1993. How it moved from Japan to rest of the world to become wildly popular language we know of today.\n","categories":null},"excerpt":"Ruby has always been one of my favorite languages, though I've sometimes found\nit hard to express why that is. The best I've been able to do…"}},{"node":{"id":"6eac670c-50b9-52de-88ad-f00bd1852a27","fields":{"slug":"/blog/series/2bithistory/the-most-important-database/"},"frontmatter":{"title":"The Most Important Database You've Never Heard of","date":"07 October, 2017","desc":"In 1962, JFK challenged Americans to send a man to the moon by the end of the decade, inspiring a heroic engineering effort that culminated in Neil Armstrong's first steps on the lunar surface. But the Apollo Program was so staggeringly complex that new technologies had to be invented even to do the mundane things. One of these technologies was IBM's Information Management System (IMS).\n","categories":null},"excerpt":"In 1962, JFK challenged Americans to send a man to the moon by the end of the\ndecade, inspiring a heroic engineering effort that culminated…"}}]},"markdownRemark":{"id":"2167b792-dc28-5757-8431-4025a03da516","html":"<p>This is my about page!</p>","frontmatter":{"title":"Blog Posts","layout":null,"postsPerPage":5},"fields":{"slug":"/blog/posts/"}}},"pageContext":{"limit":5,"skip":45,"blogPath":"/Users/deepakkarki/Desktop/discover-dev/gatsby-site/src/pages/blog//","filePath":"/Users/deepakkarki/Desktop/discover-dev/gatsby-site/src/pages/blog/posts/index.md","totalPages":11}}