{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"0464f247-23dc-5dcd-abf6-cc833ddd1ffe","fields":{"slug":"/blog/posts/inner-self/"},"frontmatter":{"title":"InnerSelf","date":"25 November, 2018","desc":"This is a source code walkthrough of InnerSelf - a tiny view + state management solution using innerHTML and ES6 template literals. InnerSelf to mimic a React+Redux solution in a minimal way, at just 600 bytes minified, ~350 bytes when gzipped.\n","categories":["frontend","software-architecture","javascript"]},"excerpt":"InnerSelf is a tiny view + state management solution using innerHTML. Aims to mimic a React+Redux solution in a minimal way, at just 60…"}},{"node":{"id":"b38ef751-f232-523e-80e5-33a12f861253","fields":{"slug":"/blog/posts/bubbly-bg/"},"frontmatter":{"title":"Bubbly-bg","date":"24 November, 2018","desc":"This is a source code walkthrough of Bubbly-bg - a tiny dependency free library to get beautiful animated bubbly backgrounds for your webpages.\n","categories":["frontend","software-architecture","javascript"]},"excerpt":"This is a source code walkthrough of Bubbly-bg - a tiny js library to get beautiful animated bubbly backgrounds for your webpages. Bubbly-bg…"}},{"node":{"id":"101b7075-702b-5a26-9a71-c06cb08f0c68","fields":{"slug":"/blog/series/2bithistory/cat/"},"frontmatter":{"title":"The Source History of Cat","date":"12 November, 2018","desc":"A tour of the many historical implementations of the Unix cat utility. Ken Thompson and Dennis Ritchie began writing Unix on a PDP 7. This was in 1969, before C, so all of the early Unix software was written in PDP 7 assembly. The first implementation of cat is thus in PDP 7 assembly. See how cat evolved from the 1960s PDP implementation to how it is today.\n","categories":null},"excerpt":"I once had a debate with members of my extended family about whether a computer\nscience degree is a degree worth pursuing. I was in college…"}},{"node":{"id":"b31740a7-1bc3-5483-bae7-ce9497f1bfdb","fields":{"slug":"/blog/series/2bithistory/lisp/"},"frontmatter":{"title":"How Lisp Became God's Own Programming Language","date":"14 October, 2018","desc":"A look at the fascinating history behind the one programming language with magical powers. \"John McCarthy, Lisp's creator, did not originally intend for Lisp to be an elegant distillation of the principles of computation. But, after one or two fortunate insights and a series of refinements, that's what Lisp became.\"\n","categories":null},"excerpt":"When programmers discuss the relative merits of different programming\nlanguages, they often talk about them in prosaic terms as if they were…"}},{"node":{"id":"de1516f2-ccb9-579a-a2b1-e0e80bc54f98","fields":{"slug":"/blog/series/2bithistory/chaosnet/"},"frontmatter":{"title":"A Short History of Chaosnet","date":"30 September, 2018","desc":"Chaosnet is a long-extinct network protocol. But traces of it survive in the plumbing of the internet. Chaosnet was developed in the 1970s as a part of a larger effort to design and build a machine that could run the Lisp programming language more efficiently than a general-purpose computer.\n","categories":null},"excerpt":"If you fire up   and run a DNS query for  , you will get\na response somewhat like the following: The output contains both a section…"}}]},"markdownRemark":{"id":"2167b792-dc28-5757-8431-4025a03da516","html":"<p>This is my about page!</p>","frontmatter":{"title":"Blog Posts","layout":null,"postsPerPage":5},"fields":{"slug":"/blog/posts/"}}},"pageContext":{"limit":5,"skip":0,"blogPath":"/Users/deepakkarki/Desktop/discover-dev/gatsby-site/src/pages/blog//","filePath":"/Users/deepakkarki/Desktop/discover-dev/gatsby-site/src/pages/blog/posts/index.md","totalPages":11}}