{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"e833b4e1-2cd1-5d9e-8195-aa4c443da648","fields":{"slug":"/blog/series/2bithistory/where-vim-came-from/"},"frontmatter":{"title":"Where Vim Came From","date":"05 August, 2018","desc":null,"categories":null},"excerpt":"I recently stumbled across a file format known as Intel HEX. As far as I can\ngather, Intel HEX files (which use the   extension) are meant…"}},{"node":{"id":"110046c6-a4c8-5ef3-9f88-8060076a2b7f","fields":{"slug":"/blog/series/2bithistory/dawn-of-the-microcomputer/"},"frontmatter":{"title":"Dawn of the Microcomputer: The Altair 8800","date":"22 July, 2018","desc":"What it was like using the Altair, the first successful personal computer. \"Altair was not an especially powerful computer compared to others, nor was it the first general-purpose computer to incorporate a microprocessor chip.  But the Altair was and is a kind of Ur-Computer for all of us.\"\n","categories":null},"excerpt":"Subscribers to  Popular Electronics  were a sophisticated group. The magazine's\neditor, Arthur Salsberg, felt compelled to point out as much…"}},{"node":{"id":"fa4c2110-74b1-538c-b9a3-da7c4f4051b1","fields":{"slug":"/blog/series/2bithistory/cvs/"},"frontmatter":{"title":"Version Control Before Git with CVS","date":"07 July, 2018","desc":"Github was launched in 2008. If your software engineering career, like mine, is no older than Github, then Git may be the only version control software you have ever used. Take a peep into what it was like using version control before distributed repositories and commit graphs.\n","categories":null},"excerpt":"Github was launched in 2008. If your software engineering career, like mine, is\nno older than Github, then Git may be the only version…"}},{"node":{"id":"4f759d8e-b287-50b4-80d2-9d3031efe936","fields":{"slug":"/blog/series/2bithistory/ibm-029-card-punch/"},"frontmatter":{"title":"The IBM 029 Card Punch","date":"23 June, 2018","desc":"A glimpse into how programming was done back in the 1960s the era of punch card programming. Trace the evolution of our early programming tools - \"When they were first invented, punch cards were punched with circular holes, but IBM realized that they could fit more columns on a card if the holes were narrow rectangles\" Bonus: Get to know where the the 80 character limit in programming came from!\n","categories":null},"excerpt":"Lines of code longer than 80 characters drive me crazy. I appreciate that this\nis pedantic. I've seen people on the internet make good…"}},{"node":{"id":"a9ea8ab4-adc2-5931-b86a-44700d67c558","fields":{"slug":"/blog/series/2bithistory/birth-of-the-web/"},"frontmatter":{"title":"The World Wide Web and Its Inventor","date":"10 June, 2018","desc":"The fascinating story of Tim Berners-Lee and the invention of the web. In 1989, when Tim first proposed the idea that would become the WWW, a new set of standards called TCP/IP were being developed which allowed previously isolated computer networks to talk to each other. This synergy between an open networking standard and Tim's hypertext system led to the web as we know it today!\n","categories":null},"excerpt":"The miraculous thing about Tim Berners-Lee is that he was the perfect person\nfor the job. In 1989, when Berners-Lee first proposed the idea…"}}]},"markdownRemark":{"id":"2167b792-dc28-5757-8431-4025a03da516","html":"<p>This is my about page!</p>","frontmatter":{"title":"Blog Posts","layout":null,"postsPerPage":5},"fields":{"slug":"/blog/posts/"}}},"pageContext":{"limit":5,"skip":45,"blogPath":"/Users/deepakkarki/Desktop/discover-dev/gatsby-site/src/pages/blog//","filePath":"/Users/deepakkarki/Desktop/discover-dev/gatsby-site/src/pages/blog/posts/index.md","totalPages":11}}