{"data":{"markdownRemark":{"htmlAst":{"type":"root","children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The miraculous thing about Tim Berners-Lee is that he was the perfect person\nfor the job."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"In 1989, when Berners-Lee first proposed the idea that would become the World\nWide Web, exciting things were happening in the realm of computing. A new set\nof standards called TCP/IP were allowing previously isolated computer networks\nto talk to each other. These standards had become popular, particularly in the\nAmerican scientific community. By 1989, TCP/IP was also just starting to be\nadopted by commercial service providers like CompuServe."}]},{"type":"text","value":"\n"},{"type":"comment","value":"more"},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Meanwhile, an annual conference had recently been established to discuss a\npromising new avenue of computing research: hypertext. First conceived of in\nthe 1960s, hypertext found itself back in the spotlight after Apple released a\nprogram for the Macintosh in 1987 called HyperCard. HyperCard was a kind of\nsimplified software development environment that allowed even the least savvy\nMac user to assemble an interactive application out of a \"stack\" of interlinked\ncards. Though the cards did not contain text body hyperlinks as we think of\nthem today, a card could contain buttons that, when clicked, navigated to other\ncards. HyperCard was tremendously successful and even beloved by many, so much\nso that last year it was "},{"type":"element","tagName":"a","properties":{"href":"https://www.vipercard.net/"},"children":[{"type":"text","value":"recreated"}]},{"type":"text","value":" by a fan.\nHyperCard's success inspired new interest in hypertext, which some thought\nwould supplant the printed word as the medium of the future. Hypertext,\naccording to a book published about it at the time, was going to \"produce\neffects on our culture, particularly on our literature, education, criticism,\nand scholarship just as radical as those produced by Gutenberg's movable\ntype.\""},{"type":"element","tagName":"sup","properties":{"id":"fnref-1"},"children":[{"type":"element","tagName":"a","properties":{"href":"#fn-1","className":["footnote-ref"]},"children":[{"type":"text","value":"1"}]}]}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The one major problem was that, in 1989, all existing hypertext systems were\nclosed systems. Commercial applications of hypertext technology involved\nconverting complex documentation into hypertext form and then shipping it on a\nfloppy disk. Users could navigate the documentation more easily than if it were\nprinted in a book, but they could not follow links to documents not already\nstored on the floppy disk. Some people, like Ted Nelson, who first coined the\nterm \"hypertext\" in the 1960s, were searching desperately for a way to open up\nhypertext systems by making them work across a network—but these efforts were\nmaking little progress. It took Berners-Lee, whose personal interests and\nprofessional experiences put all the jigsaw pieces in front of him, to marry\nthe internet and hypertext together."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"img","properties":{"src":"/2bithistory/tbl_photo.jpg","alt":"Berners-Lee in 1994 with his web browser."},"children":[]}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h2","properties":{},"children":[{"type":"text","value":"ENQUIRE, Printers, and RPC"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Berners-Lee had been fascinated by the promise of something like hypertext\nsince well before HyperCard. As a child, he had talked with his father (both\nhis parents were mathematicians and programmers) about how much better it would\nbe if computers, rather than modeling the world in rigid hierarchies, modeled\nthe world as a series of loose associations, the way human beings do."},{"type":"element","tagName":"sup","properties":{"id":"fnref-2"},"children":[{"type":"element","tagName":"a","properties":{"href":"#fn-2","className":["footnote-ref"]},"children":[{"type":"text","value":"2"}]}]},{"type":"text","value":" In\n1980, four years after graduating from Oxford University with a degree in\nphysics, he went to work at CERN, the particle physics laboratory in Geneva,\nSwitzerland. CERN, as Berners-Lee describes it in his book about the creation\nof the web, had an institutional culture bordering on the anarchic."},{"type":"element","tagName":"sup","properties":{"id":"fnref-3"},"children":[{"type":"element","tagName":"a","properties":{"href":"#fn-3","className":["footnote-ref"]},"children":[{"type":"text","value":"3"}]}]},{"type":"text","value":"\nTen thousand or so people were nominally a part of CERN, but only half were\nactually in Geneva at any given time. There were only 3000 actual, salaried\nemployees; the rest were contractors or itinerant academics. As a contractor\nhimself, Berners-Lee saw that one of the biggest challenges he faced was simply\nunderstanding, amid the barrage of arrivals and departures, how people and\nprojects related to one another."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"When the weather was nice, Berners-Lee and his coworkers swapped ideas while\neating lunch outside, where bucolic vineyards climbed the slopes around\nthem."},{"type":"element","tagName":"sup","properties":{"id":"fnref-4"},"children":[{"type":"element","tagName":"a","properties":{"href":"#fn-4","className":["footnote-ref"]},"children":[{"type":"text","value":"4"}]}]},{"type":"text","value":" In the evenings and during his time off, Berners-Lee worked on a\nprogram he called ENQUIRE. ENQUIRE was his attempt to map out the tangle of\ninterconnections at CERN and was basically the first iteration of what would\nbecome the web. It used hypertext to capture the relationships that human\nbeings would otherwise most naturally represent on a piece of paper as a set of\ncircles and arrows. Users could make and follow links between documents,\npeople, and concepts. The links were all of a certain type, so that, for\nexample, the \"Vacuum Control System\" concept could have an \"includes\"\nrelationship with the \"Vacuum Equipment Modules\" concept and a \"described-by\"\nrelationship with a document named "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"Controle du System a Vide du Booster"}]},{"type":"text","value":".\nBerners-Lee named his program after a Victorian-era domestic encyclopedia and\netiquette guide called "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"Enquire Within Upon Everything"}]},{"type":"text","value":", a title he liked\nbecause it evoked a magical portal to a world full of information."},{"type":"element","tagName":"sup","properties":{"id":"fnref-5"},"children":[{"type":"element","tagName":"a","properties":{"href":"#fn-5","className":["footnote-ref"]},"children":[{"type":"text","value":"5"}]}]},{"type":"text","value":"\nBerners-Lee found that ENQUIRE did a pretty good job of living up to its\nnamesake and suited the chaotic, dynamic systems at CERN. But his contract with\nCERN would end before he had an opportunity to sell other people at CERN on its\nusefulness. On his way out the door, Berners-Lee handed the program to his\nmanager on a floppy disk, but the disk was later lost."},{"type":"element","tagName":"sup","properties":{"id":"fnref-6"},"children":[{"type":"element","tagName":"a","properties":{"href":"#fn-6","className":["footnote-ref"]},"children":[{"type":"text","value":"6"}]}]},{"type":"text","value":" (ENQUIRE's\n"},{"type":"element","tagName":"a","properties":{"href":"https://www.w3.org/History/1980/Enquire/manual/"},"children":[{"type":"text","value":"manual"}]},{"type":"text","value":", however, is still\navailable.)"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"ENQUIRE did not work across a computer network, so like the hypertext systems\nthat emerged later in the 1980s, it was a closed system. It is nonetheless to\nBerners-Lee's credit that he was exploring the possibilities of hypertext at\nsuch an early stage. For ENQUIRE to transform into the World Wide Web,\nBerners-Lee still needed to incorporate two more key technologies."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The first of these was a markup language. Serendipitously, the very next thing\nBerners-Lee did after CERN was go work for his friend, John Poole, on printer\nsoftware. John Poole ran a company called Image Computer Systems that was\ntrying to make smarter printers by incorporating a microprocessor. Berners-Lee\nhelped to write, among other things, a new markup language used to prepare\ndocuments for the printer."},{"type":"element","tagName":"sup","properties":{"id":"fnref-7"},"children":[{"type":"element","tagName":"a","properties":{"href":"#fn-7","className":["footnote-ref"]},"children":[{"type":"text","value":"7"}]}]},{"type":"text","value":" SGML, the markup language that Berners-Lee would\nlater base HTML on—HTML was in fact meant to be only a particular application\nor \"tag set\" of SGML—was first standardized in a draft specification released\nin 1980. So it's possible that, while Berners-Lee was at Image Computer\nSystems, he worked with SGML. Even if he did not, the experience would\ncertainly have taught him a lot about the challenges inherent in trying to\nrender marked up text on a page, whether physical or digital."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"In 1983, Berners-Lee decided he wanted to go back to working at CERN. He\napplied for a fellowship and moved back to Switzerland in 1984, where he joined\nCERN's Electronics and Computing for Physics division. One of his first\nassignments was to develop an RPC (remote procedure call) protocol that would\nallow one CERN computer to call a function stored on another CERN computer.\nThis might have been relatively straightforward except for the fact that CERN\ncomputers weren't all on the same network. CERN had only grown more complex\nwhile Berners-Lee had been away and CERN employees, accustomed to making their\nown choices about technology, now used a range of computers and operating\nsystems from IBM, DEC, and Control Data. Consequently, there was no single set\nof networking standards that all CERN computers understood. So Berners-Lee\nensured that his RPC system supported multiple networking protocols. In\nparticular, he made sure to support the TCP/IP protocol suite, which at that\ntime was championed only by CERN's Unix crowd but which Berners-Lee thought had\ngreat potential."},{"type":"element","tagName":"sup","properties":{"id":"fnref-8"},"children":[{"type":"element","tagName":"a","properties":{"href":"#fn-8","className":["footnote-ref"]},"children":[{"type":"text","value":"8"}]}]},{"type":"text","value":" That was when, as Berners-Lee writes, \"the Internet came into\nmy life.\""},{"type":"element","tagName":"sup","properties":{"id":"fnref-9"},"children":[{"type":"element","tagName":"a","properties":{"href":"#fn-9","className":["footnote-ref"]},"children":[{"type":"text","value":"9"}]}]}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The internet was the second key technology that enabled the web. Early in his\nsecond stint at CERN, Berners-Lee had made some desultory attempts to rewrite\nENQUIRE, because he saw that the need for a program like it still existed at\nCERN."},{"type":"element","tagName":"sup","properties":{"id":"fnref-10"},"children":[{"type":"element","tagName":"a","properties":{"href":"#fn-10","className":["footnote-ref"]},"children":[{"type":"text","value":"10"}]}]},{"type":"text","value":" But the closed nature of ENQUIRE was too limiting. Berners-Lee began\nto wonder if he could combine ENQUIRE with the communication schemes he had\ndeveloped for the RPC project. A networked version of ENQUIRE, relying on the\nincreasingly popular TCP/IP standards, would allow researchers at CERN to link\nnot only to documents on their own computers but also to documents on everyone\nelse's computers. At that point, all the pieces were in place. Berners-Lee told\nhis manager, Mike Sendall, about his ideas. Sendall told him to write a\nproposal. And so, in 1989, Berners-Lee did."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h2","properties":{},"children":[{"type":"text","value":"HyperText : Text"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Aware that CERN was unlikely to support a research project with no clear\npurpose, Berners-Lee pitched his idea as the documentation system CERN\ndesperately lacked. With the Large Hadron Collider project just over the\nhorizon—today, the LHC is the largest machine on the planet—CERN needed a\nbetter way to record and organize information. The software he was proposing,\ntentatively called the information \"mesh,\" would unify the many existing\ndocumentation systems at CERN into one easily navigated, remotely accessible\nbody of hypertext. Importantly, his new system would not impose any kind of\nartificial hierarchy on the data being stored. In an interesting echo of Edgar\nF. Codd, who "},{"type":"element","tagName":"a","properties":{"href":"/blog/series/2bithistory/codd-relational-model"},"children":[{"type":"text","value":"ten years earlier"}]},{"type":"text","value":"\ndemonstrated the many advantages of the relational database model over the\nprevailing hierarchical models, Berners-Lee warns against letting a\nhierarchical method of storage put undue constraints on the information stored.\nInstead, users should be able to make links between nodes in the structure\narbitrarily."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Berners-Lee's "},{"type":"element","tagName":"a","properties":{"href":"https://www.w3.org/History/1989/proposal.html"},"children":[{"type":"text","value":"original\nproposal"}]},{"type":"text","value":" is light on technical\ndetails and is almost a philosophical statement rather than a technical plan.\nThere is no mention of markup languages or even of anything like HTTP, though\nBerners-Lee does say that an important part of the project will be defining an\ninterface between clients and servers. The closest he gets to describing how\nhis system will work in practice is when he asks his readers to imagine \"the\nreferences in this document, all being associated with the network address of\nthe thing to which they referred, so that while reading this document you could\nskip to them with a click of the mouse.\" Reading the proposal today, it's\nobvious to us what Berners-Lee is describing—that's the web! But, in 1989, it\nwould have been hard to grasp what this meta-documentation system was all\nabout. Sendall supposedly wrote on his copy of the proposal that it was \"vague\nbut exciting.\""},{"type":"element","tagName":"sup","properties":{"id":"fnref-11"},"children":[{"type":"element","tagName":"a","properties":{"href":"#fn-11","className":["footnote-ref"]},"children":[{"type":"text","value":"11"}]}]}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Perhaps the most intriguing thing about the proposal is that, at least in 1989,\nBerners-Lee seems to have thought that he would be making a network-enabled\nENQUIRE. The diagram he includes on the first page of his proposal shows nodes\nof several different kinds—there are people, concepts, documents, and software\nprograms—connected according to a fixed set of relationships. ENQUIRE certainly\nworked that way; you had to tell it how things were related. Nodes and links\nwere "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"typed"}]},{"type":"text","value":". But the web would not end up with typed links at all. ENQUIRE's\ntyped links and nodes lent themselves to interesting analysis, since you could\nhypothetically ask, for example, \"How many people work in the Electronics and\nComputing for Physics division at CERN?\" Answering questions like that would\nnot be possible on the web. A decade later, Berners-Lee and hundreds of others\nwould "},{"type":"element","tagName":"a","properties":{"href":"/blog/series/2bithistory/semantic-web"},"children":[{"type":"text","value":"try to bring typing back"}]},{"type":"text","value":" by\nencouraging everyone to use semantic web technologies, with only mixed success.\nIt's fascinating to know that the web, at least as originally conceived, was\nsupposed to be a semantic web all along."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"img","properties":{"src":"/2bithistory/web_diagram.gif","alt":"The diagram from the cover of the 1989 proposal."},"children":[]}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Berners-Lee sent his proposal around to a few people at CERN, but it was, for\nthe most part, politely ignored. A year later, Berners-Lee, more convinced than\never that he was on to something, worked with CERN veteran Robert Cailliau to\nrewrite his original proposal in more concrete terms."},{"type":"element","tagName":"sup","properties":{"id":"fnref-12"},"children":[{"type":"element","tagName":"a","properties":{"href":"#fn-12","className":["footnote-ref"]},"children":[{"type":"text","value":"12"}]}]},{"type":"text","value":" The "},{"type":"element","tagName":"a","properties":{"href":"https://www.w3.org/Proposal.html"},"children":[{"type":"text","value":"1990\nproposal"}]},{"type":"text","value":" focuses on the resources that would\nbe required to build a working prototype of what Berners-Lee was now calling\n\"WorldWideWeb.\" It also specifies that the project would involve creating,\namong other things, a standard protocol for retrieving documents, a standard\nformat for representing documents, and a program that would allow users to view\nretrieved text documents and possibly graphics. This second proposal allowed\nBerners-Lee to pull together a small team and start creating the web."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The first thing that Berners-Lee worked on was a client. Berners-Lee's manager,\nMike Sendall, had just allowed him to purchase a NeXTSTEP workstation. NeXTSTEP\nwas a new operating system produced by NeXT, the company that Steve Jobs\nfounded after being ousted from Apple. Berners-Lee had decided that the\nNeXTSTEP system, known for its powerful and easy-to-use software development\nframework, would make developing the \"browser\" program straightforward."},{"type":"element","tagName":"sup","properties":{"id":"fnref-13"},"children":[{"type":"element","tagName":"a","properties":{"href":"#fn-13","className":["footnote-ref"]},"children":[{"type":"text","value":"13"}]}]},{"type":"text","value":"\nIndeed, the framework, written in Objective-C and leveraging the latest new\nprogramming paradigm (something called \"object-oriented programming\"), made it\nas easy as creating a new subclass of the existing "},{"type":"element","tagName":"code","properties":{"className":["language-text"]},"children":[{"type":"text","value":"Text"}]},{"type":"text","value":" class called\n"},{"type":"element","tagName":"code","properties":{"className":["language-text"]},"children":[{"type":"text","value":"HyperText"}]},{"type":"text","value":". Other classes Berners-Lee wrote had the prefix "},{"type":"element","tagName":"code","properties":{"className":["language-text"]},"children":[{"type":"text","value":"HT"}]},{"type":"text","value":", for\nhypertext, because prefixing class names was a convention when using NeXTSTEP's\napplication framework. If this seems familiar to anyone, that's because NeXT\neventually got bought by Apple. The AppKit framework that iOS and Mac\ndevelopers know so well today is only the modern incarnation of the framework\nBerners-Lee used to build the first web browser. Berners-Lee's browser,\n"},{"type":"element","tagName":"code","properties":{"className":["language-text"]},"children":[{"type":"text","value":"WorldWideWeb.app"}]},{"type":"text","value":", even had an "},{"type":"element","tagName":"a","properties":{"href":"https://github.com/sinclairtarget/www-beginnings/blob/master/1991-WWW-NeXT/Implementation/HyperManager.m"},"children":[{"type":"text","value":"application\ndelegate"}]},{"type":"text","value":"."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The other piece of software that Berners-Lee had to write was a basic HTTP\nserver. That code would eventually become known as CERN HTTPd. The original\nversion ran on NeXT systems and on an operating system called VAX/VMS,\ndeveloped by Digital Equipment Corporation and popular among some people at\nCERN. The original version fit inside one file, named\n"},{"type":"element","tagName":"a","properties":{"href":"https://github.com/sinclairtarget/www-beginnings/blob/master/cern-httpd/v0.1/daemon.c"},"children":[{"type":"text","value":"daemon.c"}]},{"type":"text","value":",\nwhich is well worth reading through. By default, the first HTTP server ran on\nport 2784 and supported only "},{"type":"element","tagName":"code","properties":{"className":["language-text"]},"children":[{"type":"text","value":"GET"}]},{"type":"text","value":" requests and another kind of request called\n"},{"type":"element","tagName":"code","properties":{"className":["language-text"]},"children":[{"type":"text","value":"FIND"}]},{"type":"text","value":". It implemented the "},{"type":"element","tagName":"a","properties":{"href":"https://www.w3.org/Protocols/HTTP/AsImplemented.html"},"children":[{"type":"text","value":"original HTTP\nspecification"}]},{"type":"text","value":"."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Soon enough, Berners-Lee had a client and a server talking to each other using\nHTTP. But the web browser he had built only ran on NeXT machines, which would\nhave a long legacy in computing but which were not, in fact, all that popular.\nThis bothered Berners-Lee, because the whole point of having a world-wide web\nwas that it would be universal. A web browser that only ran on one system did\nnot do a good job of demonstrating the web's potential. So on the advice of\nanother CERN employee, Ben Segal, Berners-Lee hired an intern named Nicola\nPellow to create what they called a \"line-mode\" browser."},{"type":"element","tagName":"sup","properties":{"id":"fnref-14"},"children":[{"type":"element","tagName":"a","properties":{"href":"#fn-14","className":["footnote-ref"]},"children":[{"type":"text","value":"14"}]}]},{"type":"text","value":" The line-mode\nbrowser would be text-only, making it easy to port to lots of different\nsystems. Few people remember the line-mode browser now, but many more people\nfirst encountered the web via the line-mode browser than via Berners-Lee's\noriginal NeXT browser. The cool thing about the line-mode browser is that CERN\nhas recently created an\n"},{"type":"element","tagName":"a","properties":{"href":"http://line-mode.cern.ch/www/hypertext/WWW/TheProject.html"},"children":[{"type":"text","value":"emulation"}]},{"type":"text","value":" of it,\nso if you're idea of fun involves browsing the web like it's 1991, this is\nsomething you can do."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h2","properties":{},"children":[{"type":"text","value":"The Web Goes Public"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Berners-Lee first told people outside of CERN about the web when he described\nit in "},{"type":"element","tagName":"a","properties":{"href":"https://www.w3.org/People/Berners-Lee/1991/08/art-6484.txt"},"children":[{"type":"text","value":"a post"}]},{"type":"text","value":" to\nthe alt.hypertext newsgroup made in August of 1991. He was responding to a\nquestion somebody else had asked about whether anyone was working on a\nhypertext system that could retrieve information from \"heterogeneous\" sources.\nIn the post, Berners-Lee lays out the work that had been done so far on the\n\"WorldWideWeb\" project and invites anyone interested in seeing the code to\nemail him."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Later that year, in September, the web spread outside of Europe to the Stanford\nLinear Accelerator Center. From there it spread to other research centers\naround the world. Other people began making their own web browsers for\ndifferent operating systems and some of these web browsers were dramatic\nimprovements on Berners-Lee's original browser. In 1993, a team of young\ngraduate students at the National Center for Supercomputing Applications in\nIllinois created Mosaic, which among other achievements was the first browser\nto display images inline instead of in a separate window. Mosaic was so easy to\ninstall and use that it kicked off a massive boom in the popularity of the web\nand effectively ushered in the internet age."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"By the time Mosaic launched, the web had long ceased to be under Berners-Lee's\nsole control. Other people would have greater influence over its evolution and\ngrowth in the years to come. But the web would, of course, always be remembered\nas Berners-Lee's invention."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Could anyone else have invented the web? As is sometimes the case with new\ntechnologies, in 1989, the web—or at least something like it—seems to have been\nalmost inevitable. Interest in hypertext was growing even as TCP/IP made it\neasier for different computer systems to talk to each other. Questions like the\none asked on the alt.hypertext newsgroup about hypertext connecting\n\"heterogeneous\" systems show that other people were beginning to see the\npotential of such a system. Then again, people like Ted Nelson spent years\ntrying to create a universal hypertext system without getting anywhere.\nBerners-Lee, fortunate enough to have worked with, in short order, hypertext\nsystems, markup languages, and RPC protocols, was uniquely situated to bring\nthose strands together. Without Berners-Lee, a \"web\" may eventually have\nemerged, but it might not have happened for several more years and it might not\nhave resembled the free and open web that Berners-Lee gave us."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"hr","properties":{},"children":[]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{"style":"color:#5f5f5f;font-size:16px;font-style: italic;padding-top:2em;text-align:center"},"children":[{"type":"text","value":"\noriginally posted at "},{"type":"element","tagName":"a","properties":{"href":"https://twobithistory.org"},"children":[{"type":"text","value":"two bit history"}]},{"type":"text","value":" under \n"},{"type":"element","tagName":"a","properties":{"href":"https://creativecommons.org/licenses/by-sa/4.0/"},"children":[{"type":"text","value":"CC BY-SA 4.0"}]},{"type":"text","value":" by "},{"type":"element","tagName":"a","properties":{"href":"http://sinclairtarget.com"},"children":[{"type":"text","value":"Sinclair Target"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"div","properties":{"className":["footnotes"]},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"hr","properties":{},"children":[]},{"type":"text","value":"\n"},{"type":"element","tagName":"ol","properties":{},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{"id":"fn-1"},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Coover, Robert. \"The End of Books.\" The New York Times, June 21, 1992. Accessed June 2, 2018, "},{"type":"element","tagName":"a","properties":{"href":"https://archive.nytimes.com/www.nytimes.com/books/98/09/27/specials/coover-end.html?pagewanted=all"},"children":[{"type":"text","value":"https://archive.nytimes.com/www.nytimes.com/books/98/09/27/specials/coover-end.html?pagewanted=all"}]},{"type":"text","value":"."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"a","properties":{"href":"#fnref-1","className":["footnote-backref"]},"children":[{"type":"text","value":"↩"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{"id":"fn-2"},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Berners-Lee, Tim, and Mark Fischetti. "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"Weaving the Web: The Original Design and Ultimate Destiny of the World Wide Web"}]},{"type":"text","value":". (Harper Business, 2000), 3."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"a","properties":{"href":"#fnref-2","className":["footnote-backref"]},"children":[{"type":"text","value":"↩"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{"id":"fn-3"},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Berners-Lee, 9."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"a","properties":{"href":"#fnref-3","className":["footnote-backref"]},"children":[{"type":"text","value":"↩"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{"id":"fn-4"},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"ibid."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"a","properties":{"href":"#fnref-4","className":["footnote-backref"]},"children":[{"type":"text","value":"↩"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{"id":"fn-5"},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Berners-Lee, 1."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"a","properties":{"href":"#fnref-5","className":["footnote-backref"]},"children":[{"type":"text","value":"↩"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{"id":"fn-6"},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Berners-Lee, 11."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"a","properties":{"href":"#fnref-6","className":["footnote-backref"]},"children":[{"type":"text","value":"↩"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{"id":"fn-7"},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Berners-Lee, 12."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"a","properties":{"href":"#fnref-7","className":["footnote-backref"]},"children":[{"type":"text","value":"↩"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{"id":"fn-8"},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Berners-Lee, 19."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"a","properties":{"href":"#fnref-8","className":["footnote-backref"]},"children":[{"type":"text","value":"↩"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{"id":"fn-9"},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"ibid."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"a","properties":{"href":"#fnref-9","className":["footnote-backref"]},"children":[{"type":"text","value":"↩"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{"id":"fn-10"},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Berners-Lee, 15."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"a","properties":{"href":"#fnref-10","className":["footnote-backref"]},"children":[{"type":"text","value":"↩"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{"id":"fn-11"},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"\"Tim Berners-Lee's Proposal\". CERN, accessed June 10, 2018, "},{"type":"element","tagName":"a","properties":{"href":"http://info.cern.ch/Proposal.html"},"children":[{"type":"text","value":"http://info.cern.ch/Proposal.html"}]},{"type":"text","value":"."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"a","properties":{"href":"#fnref-11","className":["footnote-backref"]},"children":[{"type":"text","value":"↩"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{"id":"fn-12"},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Berners-Lee, 26."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"a","properties":{"href":"#fnref-12","className":["footnote-backref"]},"children":[{"type":"text","value":"↩"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{"id":"fn-13"},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Berners-Lee, 23."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"a","properties":{"href":"#fnref-13","className":["footnote-backref"]},"children":[{"type":"text","value":"↩"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{"id":"fn-14"},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Berners-Lee, 29."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"a","properties":{"href":"#fnref-14","className":["footnote-backref"]},"children":[{"type":"text","value":"↩"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"}]}],"data":{"quirksMode":false}},"frontmatter":{"title":"The World Wide Web and Its Inventor","author":{"name":"Sinclair Target"},"date":"10 June 2018"}}},"pageContext":{"slug":"/blog/series/2bithistory/birth-of-the-web/"}}