{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"6eac670c-50b9-52de-88ad-f00bd1852a27","fields":{"slug":"/blog/series/2bithistory/the-most-important-database/"},"frontmatter":{"title":"The Most Important Database You've Never Heard of","date":"07 October, 2017","desc":"In 1962, JFK challenged Americans to send a man to the moon by the end of the decade, inspiring a heroic engineering effort that culminated in Neil Armstrong's first steps on the lunar surface. But the Apollo Program was so staggeringly complex that new technologies had to be invented even to do the mundane things. One of these technologies was IBM's Information Management System (IMS).\n","categories":null},"excerpt":"In 1962, JFK challenged Americans to send a man to the moon by the end of the\ndecade, inspiring a heroic engineering effort that culminated…"}},{"node":{"id":"74865257-9615-5980-91df-aa457d6ccb6a","fields":{"slug":"/blog/series/2bithistory/the-lineage-of-man/"},"frontmatter":{"title":"The Lineage of Man","date":"28 September, 2017","desc":"The story of man is inextricably tied to the story of Unix. The very first version of Unix (1971) did not provide a man command. But Douglas McIlroy,  who managed the Unix project, insisted that some kind of documentation be made  available. This resulted in the Unix Programmer's Manual which later paved way for the man pages we know today.\n","categories":null},"excerpt":"I've always found man pages fascinating. Formatted as strangely as they are and\naccessible primarily through the terminal, they have always…"}},{"node":{"id":"1dbe8e7e-bb45-5c35-a183-7ea8241e10ed","fields":{"slug":"/blog/series/2bithistory/the-rise-and-rise-of-json/"},"frontmatter":{"title":"The Rise and Rise of JSON","date":"21 September, 2017","desc":"JSON has taken over the world. Today, when any two applications communicate with each other across the internet, odds are they do so using JSON. It has been adopted by all the big players: Of the ten most popular web APIs, a list consisting mostly of APIs offered by major companies like Google, Facebook, and Twitter, only one API exposes data in XML rather than JSON.\n","categories":null},"excerpt":"JSON has taken over the world. Today, when any two applications communicate\nwith each other across the internet, odds are they do so using…"}}]},"markdownRemark":{"id":"2167b792-dc28-5757-8431-4025a03da516","html":"<p>This is my about page!</p>","frontmatter":{"title":"Blog Posts","layout":null,"postsPerPage":5},"fields":{"slug":"/blog/posts/"}}},"pageContext":{"limit":5,"skip":55,"blogPath":"/Users/deepakkarki/Desktop/discover-dev/gatsby-site/src/pages/blog//","filePath":"/Users/deepakkarki/Desktop/discover-dev/gatsby-site/src/pages/blog/posts/index.md","totalPages":12}}