{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"1dbe8e7e-bb45-5c35-a183-7ea8241e10ed","fields":{"slug":"/blog/series/2bithistory/the-rise-and-rise-of-json/"},"frontmatter":{"title":"The Rise and Rise of JSON","date":"21 September, 2017","desc":"JSON has taken over the world. Today, when any two applications communicate with each other across the internet, odds are they do so using JSON. It has been adopted by all the big players: Of the ten most popular web APIs, a list consisting mostly of APIs offered by major companies like Google, Facebook, and Twitter, only one API exposes data in XML rather than JSON.\n"},"excerpt":"JSON has taken over the world. Today, when any two applications communicate\nwith each other across the internet, odds are they do so using…"}},{"node":{"id":"74865257-9615-5980-91df-aa457d6ccb6a","fields":{"slug":"/blog/series/2bithistory/the-lineage-of-man/"},"frontmatter":{"title":"The Lineage of Man","date":"28 September, 2017","desc":"The story of man is inextricably tied to the story of Unix. The very first version of Unix (1971) did not provide a man command. But Douglas McIlroy,  who managed the Unix project, insisted that some kind of documentation be made  available. This resulted in the Unix Programmer's Manual which later paved way for the man pages we know today.\n"},"excerpt":"I've always found man pages fascinating. Formatted as strangely as they are and\naccessible primarily through the terminal, they have always…"}},{"node":{"id":"6eac670c-50b9-52de-88ad-f00bd1852a27","fields":{"slug":"/blog/series/2bithistory/the-most-important-database/"},"frontmatter":{"title":"The Most Important Database You've Never Heard of","date":"07 October, 2017","desc":"In 1962, JFK challenged Americans to send a man to the moon by the end of the decade, inspiring a heroic engineering effort that culminated in Neil Armstrong's first steps on the lunar surface. But the Apollo Program was so staggeringly complex that new technologies had to be invented even to do the mundane things. One of these technologies was IBM's Information Management System (IMS).\n"},"excerpt":"In 1962, JFK challenged Americans to send a man to the moon by the end of the\ndecade, inspiring a heroic engineering effort that culminated…"}},{"node":{"id":"89f67bfc-77b2-5da7-99f1-6b8bd2c3796f","fields":{"slug":"/blog/series/2bithistory/the-ruby-story/"},"frontmatter":{"title":"The Ruby Story","date":"19 November, 2017","desc":"We take a look at the history of Ruby. How and why it was started by a recent college grad, Yukihiro Matsumoto in 1993. How it moved from Japan to rest of the world to become wildly popular language we know of today.\n"},"excerpt":"Ruby has always been one of my favorite languages, though I've sometimes found\nit hard to express why that is. The best I've been able to do…"}},{"node":{"id":"b1db7b98-c996-54e0-be3c-f886ff7d31c5","fields":{"slug":"/blog/series/2bithistory/simulating-the-altair/"},"frontmatter":{"title":"Simulating the Altair","date":"02 December, 2017","desc":"The Altair 8800 was a build-it-yourself home computer kit released in 1975. The Altair was basically the first personal computer, though it predated the advent of that term by several years.\n"},"excerpt":"The  Altair 8800  was a\nbuild-it-yourself home computer kit released in 1975. The Altair was basically\nthe first personal computer, though…"}},{"node":{"id":"22111bc9-c9fe-5132-8583-4b0d3840cd14","fields":{"slug":"/blog/series/2bithistory/codd-relational-model/"},"frontmatter":{"title":"Important Papers: Codd and the Relational Model","date":"29 December, 2017","desc":"The relational model was introduced in 1970. Edgar Codd, a researcher at IBM, published a paper called \"A Relational Model of Data for Large Shared Data Banks.\" The paper is unassuming; Codd only claims to have employed a  novel tool (the mathematical notion of a \"relation\") to address some of the inadequacies of the prevailing database models.\n"},"excerpt":"It's hard to believe today, but the relational database was once the cool new\nkid on the block. In 2017, the relational model competes with…"}},{"node":{"id":"a9ea8ab4-adc2-5931-b86a-44700d67c558","fields":{"slug":"/blog/series/2bithistory/birth-of-the-web/"},"frontmatter":{"title":"The World Wide Web and Its Inventor","date":"10 June, 2018","desc":"The fascinating story of Tim Berners-Lee and the invention of the web. In 1989, when Tim first proposed the idea that would become the WWW, a new set of standards called TCP/IP were being developed which allowed previously isolated computer networks to talk to each other. This synergy between an open networking standard and Tim's hypertext system led to the web as we know it today!\n"},"excerpt":"The miraculous thing about Tim Berners-Lee is that he was the perfect person\nfor the job. In 1989, when Berners-Lee first proposed the idea…"}},{"node":{"id":"4f759d8e-b287-50b4-80d2-9d3031efe936","fields":{"slug":"/blog/series/2bithistory/ibm-029-card-punch/"},"frontmatter":{"title":"The IBM 029 Card Punch","date":"23 June, 2018","desc":"A glimpse into how programming was done back in the 1960s the era of punch card programming. Trace the evolution of our early programming tools - \"When they were first invented, punch cards were punched with circular holes, but IBM realized that they could fit more columns on a card if the holes were narrow rectangles\" Bonus: Get to know where the the 80 character limit in programming came from!\n"},"excerpt":"Lines of code longer than 80 characters drive me crazy. I appreciate that this\nis pedantic. I've seen people on the internet make good…"}},{"node":{"id":"fa4c2110-74b1-538c-b9a3-da7c4f4051b1","fields":{"slug":"/blog/series/2bithistory/cvs/"},"frontmatter":{"title":"Version Control Before Git with CVS","date":"07 July, 2018","desc":"Github was launched in 2008. If your software engineering career, like mine, is no older than Github, then Git may be the only version control software you have ever used. Take a peep into what it was like using version control before distributed repositories and commit graphs.\n"},"excerpt":"Github was launched in 2008. If your software engineering career, like mine, is\nno older than Github, then Git may be the only version…"}},{"node":{"id":"110046c6-a4c8-5ef3-9f88-8060076a2b7f","fields":{"slug":"/blog/series/2bithistory/dawn-of-the-microcomputer/"},"frontmatter":{"title":"Dawn of the Microcomputer: The Altair 8800","date":"22 July, 2018","desc":"What it was like using the Altair, the first successful personal computer. \"Altair was not an especially powerful computer compared to others, nor was it the first general-purpose computer to incorporate a microprocessor chip.  But the Altair was and is a kind of Ur-Computer for all of us.\"\n"},"excerpt":"Subscribers to  Popular Electronics  were a sophisticated group. The magazine's\neditor, Arthur Salsberg, felt compelled to point out as much…"}}]},"markdownRemark":{"id":"a1831f3a-3008-51fd-8cf9-58fa9cbcdfda","html":"<p>This content is adopted from <a href=\"https://twobithistory.org/\">TwobitHistory.org</a>, which has been graciously released under <a href=\"https://creativecommons.org/licenses/by-sa/4.0/\">CC BY-SA 4.0</a> by <a href=\"http://sinclairtarget.com\">Sinclair Target</a></p>\n<p>This is a series about computer history intended primarily for computer people. While there is a lot of writing out there about the history of computing for a general audience, there is much less for a technical audience — which is a shame, because there are so many interesting historical questions that might only occur to somebody who designs and builds software every day, questions like Where did JSON come from? and Why are man pages still a thing?</p>","frontmatter":{"title":"Two Bit History","layout":null,"postsPerPage":10},"fields":{"slug":"/blog/series/2bithistory/"}}},"pageContext":{"limit":10,"skip":0,"seriesPath":"/pages/blog/series/2bithistory//","filePath":"/Users/deepakkarki/Desktop/discover-dev/gatsby-site/src/pages/blog/series/2bithistory/index.md","totalPages":1,"seriesName":"2bithistory"}}